# pandas

* Pandas is a Python library.
* Pandas is used to analyze data.
* It has functions for analyzing, cleaning, exploring, and manipulating data.
*

In [4]:
import pandas

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

In [4]:
a = [1, 7, 2]              #A Pandas Series is like a column in a table.It is a one-dimensional array holding data of any type.
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [5]:
print(myvar[0])

1

In [6]:
a = [1, 7, 2]                 # Create Labels With the index argument, you can name your own labels.
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [7]:
calories = {"day1": 420, "day2": 380, "day3": 390}     #Key/Value Objects as Series You can also use a key/value object, like a dictionary, when creating a Series.
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [8]:
data = {                             #creating a data frame
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

In [9]:
data = {                           #naming the indexes
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df = pd.DataFrame(data, index=['day1','day2','day3'])
print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [10]:
df=pd.read_csv("sales_data_sample.csv",encoding="latin1")     
df

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [16]:
df=pd.read_csv(r'C:\Users\Sai\A in Acodes\data science\4. pandas\sales_data_sample.csv',encoding='latin1')
df

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [18]:
#store=pd.read_csv(r'C:\Users\Sai\naresh it codes\pandas\Sample - Superstore_Orders.csv')
#store

In [20]:
#df=pd.read_excel("SampleSuperstore.xlsx")
#df

In [14]:
df=pd.read_json("sample_Data.json")
df

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
1,2,Samsung Galaxy S21,The Samsung Galaxy S21 features a 6.2-inch Dyn...,799.00,Electronics,https://images.samsung.com/is/image/samsung/p6...
2,3,Sony PlayStation 5,The Sony PlayStation 5 features an AMD Zen 2-b...,499.99,Electronics,https://www.sony.com/image/44baa604124b770c824...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
4,5,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,299.00,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...
5,6,Fitbit Versa 3 Smartwatch,The Fitbit Versa 3 Smartwatch features a built...,229.95,Electronics,https://www.fitbit.com/global/content/dam/fitb...
6,7,KitchenAid Stand Mixer,The KitchenAid Stand Mixer features a 5-quart ...,399.99,Home & Kitchen,https://www.kitchenaid.com/content/dam/global/...
7,8,Dyson V11 Absolute Cordless Vacuum,The Dyson V11 Absolute Cordless Vacuum feature...,699.99,Home Appliances,https://www.dysoncanada.ca/dam/dyson/images/pr...
8,9,Ninja Foodi Smart XL Grill,The Ninja Foodi Smart XL Grill features 6-in-1...,279.99,Home & Kitchen,https://www.ninjakitchen.com/medias/Ninja-OP50...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...
10,11,Apple AirPods Pro,The Apple AirPods Pro feature active noise can...,249.00,Electronics,https://www.apple.com/v/airpods-pro/b/images/m...
11,12,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,299.00,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...
12,13,Fitbit Charge 4 Fitness Tracker,The Fitbit Charge 4 Fitness Tracker features G...,129.95,Electronics,https://www.fitbit.com/global/content/dam/fitb...
13,14,Samsung Galaxy Watch3,The Samsung Galaxy Watch3 features a rotating ...,399.99,Electronics,https://images.samsung.com/is/image/samsung/as...
14,15,Sony WH-1000XM4 Wireless Noise-Cancelling Head...,The Sony WH-1000XM4 Wireless Noise-Cancelling ...,349.99,Electronics,https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15,16,Breville Barista Express Espresso Machine,The Breville Barista Express Espresso Machine ...,699.95,Home & Kitchen,https://www.breville.com/content/dam/breville/...
16,17,Keurig K-Elite Coffee Maker,The Keurig K-Elite Coffee Maker features a str...,169.99,Home & Kitchen,https://www.keurig.com/content/dam/global-ecom...
17,18,iRobot Roomba i7+ Robot Vacuum,The iRobot Roomba i7+ Robot Vacuum features au...,799.99,Home & Kitchen,https://store.irobot.com/default/i7-vacuuming-...
18,19,Ninja Foodi Digital Air Fry Oven,The Ninja Foodi Digital Air Fry Oven features ...,209.99,Home & Kitchen,https://www.ninjakitchen.com/static/img/produc...
19,20,Cuisinart ICE-70 Ice Cream Maker,The Cuisinart ICE-70 Ice Cream Maker features ...,139.99,Home & Kitchen,https://www.cuisinart.com/share/images/product...

In [21]:
data={
    "name":['ram','shyam','sai'],
    "age":[10,20,30],
    "city":['x','y','z']
}
df=pd.DataFrame(data)
df

    name  age city
0    ram   10    x
1  shyam   20    y
2    sai   30    z

In [ ]:
df.to_csv("output.csv",index=False)        #saving as csv xlsx and json
df

df.to_excel("output.xlsx",index=False)
df

df.to_json("output.json",index=False)
df

In [ ]:
df.tail()

In [ ]:
df=pd.read_json("sample_Data.json")
df

df.head(10)
df.tail()

In [ ]:
df.info()

In [ ]:
df.describe()       #calculates the total column summary   idd for ints,floats and objests

In [ ]:
df.shape

In [ ]:
df.columns

In [ ]:
df

In [ ]:
df['calories']     #accesing columns

In [ ]:
df.loc[0]

In [ ]:
df[['calories','duration']]        #accesing multiple columns

In [ ]:
df.loc[[0,1]]

In [ ]:
#to filter rows

df[(df["duration"]<50)]

In [ ]:
df[(df["duration"]<50) & (df['calories']>380)]       #filter multi[le rows

In [ ]:
df[(df["duration"]<50) | (df['calories']<400)]

In [ ]:
# #changing column name and row names
# #cloumns
# store.columns=['','','','',........all new column names']

# #rows
# data = {
#   "calories": [420, 380, 390],
#   "duration": [50, 40, 45]
# }
# df = pd.DataFrame(data, index = ["day1", "day2", "day3"])
# print(df)

In [ ]:
#adding elements

df

In [ ]:
data={
    "Name":['Ram','Shyam','Ghanesh','Ddhanush','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,34,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,90,78,92,88,95,80,89]
}
df=pd.DataFrame(data)
print(df)

In [ ]:
df["Bonus"]=df['Salary']*0.1          #add column
df

In [ ]:
df.insert(0,"Employee_N",[10,20,30,40,50,60,70,80])       #add using insert
df                                                      #df.insert(loc,"columnname",data

In [ ]:
#updating value
df.loc[0,'Salary']=45000            #updating 1 value
df

In [ ]:
df["Annual"]=df['Salary']*12          #add column
df

In [ ]:
df.drop('salary',axis=1)                   #drop element

updating

In [ ]:
df.loc[0,'Salary']=55000
df

In [ ]:
df['Age']=df['Age']+1
df

In [ ]:
df.drop('salary',axis=1)                   #drop element

In [ ]:
# df.drop(columns=['Bonus','Annual'],axis=1,inplace=True)
# df

handling missing data

In [ ]:
data={
    "Name":['Ram','Shyam','Ghanesh','Ddhanush','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,34,22,30,None,240,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,90,78,92,88,None,None,89]
}
df=pd.DataFrame(data)
print(df)

In [ ]:
df.isnull()

In [ ]:
df.isnull().sum()

In [ ]:
df.dropna(inplace=True)
df

In [ ]:
df.fillna(0,inplace=True)          #insted of none giving a value 0
df

In [ ]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df

#interpolation      predicts the missing number    #linear,polynomial,time etcc

In [ ]:
df.interpolate(method="linear", axis=0,inplace=True)
df

In [ ]:
data={
    "time":[1,2,3,4,5],
    "value":[10,None,30,None,50]
}
df=pd.DataFrame(data)
print(df)
df["value"]=df['value'].interpolate(method="linear")
print("after interpolation")
df

#Sorting and aggregration

In [18]:
#sorting data in 1 column sort_values()
data={
    "Name":['Ram','Shyam','Ghanesh','Ddhanush'],
    "Age":[28,34,22,30],
    "Salary":[50000,60000,45000,62000],
    "Performance_Score":[85,90,78,92]
}
df=pd.DataFrame(data)
df.sort_values(by="Age",ascending=True, inplace=True)
df

       Name  Age  Salary  Performance_Score
2   Ghanesh   22   45000                 78
0       Ram   28   50000                 85
3  Ddhanush   30   62000                 92
1     Shyam   34   60000                 90

In [21]:
data={
    "Name":['Ram','Shyam','Ghanesh','Ddhanush'],
    "Age":[28,34,22,30],
    "Salary":[50000,60000,45000,62000],
    "Performance_Score":[85,90,78,92]
}
df=pd.DataFrame(data)
df.sort_values(by=["Age","Salary"],ascending=[True,False], inplace=True)
df

       Name  Age  Salary  Performance_Score
2   Ghanesh   22   45000                 78
0       Ram   28   50000                 85
3  Ddhanush   30   62000                 92
1     Shyam   34   60000                 90

aggegration

In [24]:
data={
    "Name":['Ram','Shyam','Ghanesh','Ddhanush'],
    "Age":[28,34,22,30],
    "Salary":[50000,60000,45000,62000],
    "Performance_Score":[85,90,78,92]
}
df=pd.DataFrame(data)
meandata=df["Salary"].mean()           #similarly sum(), min() , max() , count() , std()
meandata

np.float64(54250.0)

grouping

In [26]:
data={
    "Name":['Ram','Shyam','Ghanesh','Ddhanush','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,34,22,30,28,34,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,90,78,92,88,None,None,89]
}
df=pd.DataFrame(data)
grouped=df.groupby("Age")["Salary"].mean()              #groups the similar age then caluculates the mean
grouped

Age
22    45000.0
25    48000.0
28    49500.0
30    52000.0
32    58000.0
34    65000.0
Name: Salary, dtype: float64

Merging and Joining

In [27]:
df_customers= pd.DataFrame({
    'Customerid':

_IncompleteInputError: incomplete input (3217485025.py, line 2)